package com.autonavi.cms.util;

import java.util.ArrayList;

public class CityCode {
    // 北京市
    public static final String[][] AT_CITY_LIST0 = {
	    { "北京市", "东城区", "110101" }, { "北京市", "西城区", "110102" },
	    { "北京市", "朝阳区", "110105" }, { "北京市", "丰台区", "110106" },
	    { "北京市", "石景山区", "110107" }, { "北京市", "海淀区", "110108" },
	    { "北京市", "门头沟区", "110109" }, { "北京市", "房山区", "110111" },
	    { "北京市", "通州区", "110112" }, { "北京市", "顺义区", "110113" },
	    { "北京市", "昌平区", "110114" }, { "北京市", "大兴区", "110115" },
	    { "北京市", "怀柔区", "110116" }, { "北京市", "平谷区", "110117" },
	    { "北京市", "密云县", "110228" }, { "北京市", "延庆县", "110229" } };

    // 上海市
    public static final String[][] AT_CITY_LIST1 = {
	    { "上海市", "黄浦区", "310101" }, { "上海市", "徐汇区", "310104" },
	    { "上海市", "长宁区", "310105" }, { "上海市", "静安区", "310106" },
	    { "上海市", "普陀区", "310107" }, { "上海市", "闸北区 ", "310108" },
	    { "上海市", "虹口区", "310109" }, { "上海市", "杨浦区", "310110" },
	    { "上海市", "闵行区", "310112" }, { "上海市", "宝山区", "310113" },
	    { "上海市", "嘉定区", "310114" }, { "上海市", "浦东新区", "310115" },
	    { "上海市", "金山区", "310116" }, { "上海市", "松江区", "310117" },
	    { "上海市", "青浦区", "310118" }, { "上海市", "奉贤区", "310120" },
	    { "上海市", "崇明县", "310230" } };
    // 天津市
    public static final String[][] AT_CITY_LIST2 = {
	    { "天津市", "和平区", "120101" }, { "天津市", "河东区", "120102" },
	    { "天津市", "河西区", "120103" }, { "天津市", "南开区", "120104" },
	    { "天津市", "河北区", "120105" }, { "天津市", "红桥区", "120106" },
	    { "天津市", "滨海新区", "120116" }, { "天津市", "东丽区", "120110" },
	    { "天津市", "西青区", "120111" }, { "天津市", "津南区", "120112" },
	    { "天津市", "北辰区", "120113" }, { "天津市", "武清区", "120114" },
	    { "天津市", "宝坻区", "120115" }, { "天津市", "宁河县", "120221" },
	    { "天津市", "静海县", "120223" }, { "天津市", "蓟县", "120225" } };

    // 重庆市
    public static final String[][] AT_CITY_LIST3 = {
	    { "重庆市", "万州区", "500101" }, { "重庆市", "涪陵区", "500102" },
	    { "重庆市", "渝中区", "500103" }, { "重庆市", "大渡口区", "500104" },
	    { "重庆市", "江北区", "500105" }, { "重庆市", "沙坪坝区", "500106" },
	    { "重庆市", "九龙坡区", "500107" }, { "重庆市", "南岸区", "500108" },
	    { "重庆市", "北碚区", "500109" }, { "重庆市", "綦江区", "500110" },
	    { "重庆市", "大足区", "500111" }, { "重庆市", "渝北区", "500112" },
	    { "重庆市", "巴南区", "500113" }, { "重庆市", "黔江区", "500114" },
	    { "重庆市", "长寿区", "500115" }, { "重庆市", "江津区", "500116" },
	    { "重庆市", "合川区", "500117" }, { "重庆市", "永川区", "500118" },
	    { "重庆市", "南川区", "500119" }, { "重庆市", "潼南县", "500223" },
	    { "重庆市", "铜梁县 ", "500224" }, { "重庆市", "荣昌县 ", "500226" },
	    { "重庆市", "璧山县", "500227" }, { "重庆市", "梁平县", "500228" },
	    { "重庆市", "城口县", "500229" }, { "重庆市", "丰都县", "500230" },
	    { "重庆市", "垫江县", "500231" }, { "重庆市", "武隆县", "500232" },
	    { "重庆市", "忠县", "500233" }, { "重庆市", "开县", "500234" },
	    { "重庆市", "云阳县", "500235" }, { "重庆市", "奉节县", "500236" },
	    { "重庆市", "巫山县", "500237" }, { "重庆市", "巫溪县", "500238" },
	    { "重庆市", "石柱土家族自治县", "500240" },
	    { "重庆市", "秀山土家族苗族自治县 ", "500241" },
	    { "重庆市", "酉阳土家族苗族自治县", "500242" },
	    { "重庆市", "彭水苗族土家族自治县", "500243" } };

    // 安徽
    public static final String[][] AT_CITY_LIST4 = { { "安徽省", "合肥", "340100" },
	    { "安徽省", "芜湖", "340200" }, { "安徽省", "蚌埠", "340300" },
	    { "安徽省", "淮南", "340400" }, { "安徽省", "马鞍山", "340500" },
	    { "安徽省", "淮北", "340600" }, { "安徽省", "铜陵", "340700" },
	    { "安徽省", "安庆", "340800" }, { "安徽省", "黄山", "341000" },
	    { "安徽省", "滁州", "341100" }, { "安徽省", "阜阳", "341200" },
	    { "安徽省", "宿州", "341300" }, { "安徽省", "六安", "341500" },
	    { "安徽省", "亳州", "341600" }, { "安徽省", "池州", "341700" },
	    { "安徽省", "宣城", "341800" }, { "安徽省", "巢湖", "340181" } };

    // 福建
    public static final String[][] AT_CITY_LIST5 = { { "福建省", "福州", "350100" },
	    { "福建省", "厦门", "350200" }, { "福建省", "莆田", "350300" },
	    { "福建省", "三明", "350400" }, { "福建省", "泉州", "350500" },
	    { "福建省", "漳州", "350600" }, { "福建省", "南平", "350700" },
	    { "福建省", "龙岩", "350800" }, { "福建省", "宁德", "350900" } };

    // 广东
    public static final String[][] AT_CITY_LIST6 = { { "广东省", "广州", "440100" },
	    { "广东省", "韶关", "440200" }, { "广东省", "深圳", "440300" },
	    { "广东省", "珠海", "440400" }, { "广东省", "汕头", "440500" },
	    { "广东省", "佛山", "440600" }, { "广东省", "江门", "440700" },
	    { "广东省", "湛江", "440800" }, { "广东省", "茂名", "440900" },
	    { "广东省", "肇庆", "441200" }, { "广东省", "惠州", "441300" },
	    { "广东省", "梅州", "441400" }, { "广东省", "汕尾", "441500" },
	    { "广东省", "河源", "441600" }, { "广东省", "阳江", "441700" },
	    { "广东省", "清远", "441800" }, { "广东省", "东莞", "441900" },
	    { "广东省", "中山", "442000" }, { "广东省", "潮州", "445100" },
	    { "广东省", "揭阳", "445200" }, { "广东省", "云浮", "445300" } };

    // 广西
    public static final String[][] AT_CITY_LIST7 = {
	    { "广西壮族自治区", "南宁", "450100" }, { "广西壮族自治区", "北海", "450500" },
	    { "广西壮族自治区", "防城港", "450600" }, { "广西壮族自治区", "桂林", "450300" },
	    { "广西壮族自治区", "柳州", "450200" }, { "广西壮族自治区", "崇左", "451400" },
	    { "广西壮族自治区", "来宾", "451300" }, { "广西壮族自治区", "梧州", "450400" },
	    { "广西壮族自治区", "河池", "451200" }, { "广西壮族自治区", "玉林", "450900" },
	    { "广西壮族自治区", "贵港", "450800" }, { "广西壮族自治区", "贺州", "451100" },
	    { "广西壮族自治区", "钦州", "450700" }, { "广西壮族自治区", "百色", "451000" } };

    // 贵州
    public static final String[][] AT_CITY_LIST8 = { { "贵州省", "贵阳", "520100" },
	    { "贵州省", "安顺", "520400" }, { "贵州省", "遵义", "520300" },
	    { "贵州省", "六盘水", "520200" }, { "贵州省", "毕节", "520500" },
	    { "贵州省", "黔东南苗族侗族自治州", "522600" },
	    { "贵州省", "黔西南布依族苗族自治州", "522300" },
	    { "贵州省", "黔南布依族苗族自治州", "522700" }, { "贵州省", "铜仁", "520600" } };

    // 甘肃
    public static final String[][] AT_CITY_LIST9 = { { "甘肃省", "兰州", "620100" },
	    { "甘肃省", "白银", "620400" }, { "甘肃省", "定西", "621100" },
	    { "甘肃省", "金昌", "620300" }, { "甘肃省", "酒泉", "620900" },
	    { "甘肃省", "平凉", "620800" }, { "甘肃省", "庆阳", "621000" },
	    { "甘肃省", "武威", "620600" }, { "甘肃省", "天水", "620500" },
	    { "甘肃省", "张掖", "620700" }, { "甘肃省", "甘南藏族自治州", "623000" },
	    { "甘肃省", "嘉峪关", "620200" }, { "甘肃省", "临夏回族自治州", "622900" },
	    { "甘肃省", "陇南", "621200" } };

    // 河北
    public static final String[][] AT_CITY_LIST10 = {
	    { "河北省", "石家庄", "130100" }, { "河北省", "保定", "130600" },
	    { "河北省", "承德", "130800" }, { "河北省", "邯郸", "130400" },
	    { "河北省", "唐山", "130200" }, { "河北省", "秦皇岛", "130300" },
	    { "河北省", "沧州", "130900" }, { "河北省", "衡水", "131100" },
	    { "河北省", "廊坊", "131000" }, { "河北省", "邢台", "130500" },
	    { "河北省", "张家口", "130700" } };

    // 河南
    public static final String[][] AT_CITY_LIST11 = {
	    { "河南省", "郑州", "410100" }, { "河南省", "洛阳", "410300" },
	    { "河南省", "开封", "410200" }, { "河南省", "许昌", "411000" },
	    { "河南省", "安阳", "410500" }, { "河南省", "平顶山", "410400" },
	    { "河南省", "鹤壁", "410600" }, { "河南省", "焦作", "410800" },
	    { "河南省", "济源", "419001" }, { "河南省", "漯河", "411100" },
	    { "河南省", "南阳", "411300" }, { "河南省", "濮阳", "410900" },
	    { "河南省", "三门峡", "411200" }, { "河南省", "商丘", "411400" },
	    { "河南省", "新乡", "410700" }, { "河南省", "信阳", "411500" },
	    { "河南省", "驻马店", "411700" }, { "河南省", "周口", "411600" } };

    // 湖北
    public static final String[][] AT_CITY_LIST12 = {
	    { "湖北省", "武汉", "420100" }, { "湖北省", "襄阳", "420600" },
	    { "湖北省", "十堰", "420300" }, { "湖北省", "黄石", "420200" },
	    { "湖北省", "鄂州", "420700" }, { "湖北省", "恩施土家族苗族自治州", "422800" },
	    { "湖北省", "黄冈", "421100" }, { "湖北省", "荆州", "421000" },
	    { "湖北省", "荆门", "420800" }, { "湖北省", "随州", "421300" },
	    { "湖北省", "宜昌", "420500" }, { "湖北省", "孝感", "420900" },
	    { "湖北省", "咸宁", "421200" }, { "湖北省", "天门", "429006" },
	    { "湖北省", "潜江", "429005" }, { "湖北省", "仙桃", "429004" },
	    { "湖北省", "神农架", "429021" } };

    // 湖南
    public static final String[][] AT_CITY_LIST13 = {
	    { "湖南省", "长沙", "430100" }, { "湖南省", "岳阳", "430600" },
	    { "湖南省", "湘潭", "430300" }, { "湖南省", "常德", "430700" },
	    { "湖南省", "郴州", "431000" }, { "湖南省", "衡阳", "430400" },
	    { "湖南省", "怀化", "431200" }, { "湖南省", "娄底", "431300" },
	    { "湖南省", "邵阳", "430500" }, { "湖南省", "益阳", "430900" },
	    { "湖南省", "永州", "431100" }, { "湖南省", "株洲", "430200" },
	    { "湖南省", "张家界", "430800" }, { "湖南省", "湘西", "433100" } };

    // 黑龙江
    public static final String[][] AT_CITY_LIST14 = {
	    { "黑龙江省", "哈尔滨", "230100" }, { "黑龙江省", "大庆", "230600" },
	    { "黑龙江省", "齐齐哈尔", "230200" }, { "黑龙江省", "佳木斯", "230800" },
	    { "黑龙江省", "大兴安岭", "232700" }, { "黑龙江省", "黑河", "231100" },
	    { "黑龙江省", "鹤岗", "230400" }, { "黑龙江省", "鸡西", "230300" },
	    { "黑龙江省", "牡丹江", "231000" }, { "黑龙江省", "七台河", "230900" },
	    { "黑龙江省", "绥化", "231200" }, { "黑龙江省", "双鸭山", "230500" },
	    { "黑龙江省", "伊春", "230700" } };

    // 海南
    public static final String[][] AT_CITY_LIST15 = {
	    { "海南省", "海口", "460100" }, { "海南省", "三亚", "460200" },
	    { "海南省", "白沙黎族自治县", "469025" }, { "海南省", "保亭黎族苗族自治县", "469029" },
	    { "海南省", "昌江黎族自治县", "469026" }, { "海南省", "澄迈县", "469023" },
	    { "海南省", "定安县", "469021" }, { "海南省", "东方", "469007" },
	    { "海南省", "乐东黎族自治县", "469027" }, { "海南省", "临高县", "469024" },
	    { "海南省", "陵水黎族自治县", "469028" }, { "海南省", "琼海", "469002" },
	    { "海南省", "琼中黎族苗族自治县", "469030" }, { "海南省", "屯昌县", "469022" },
	    { "海南省", "万宁", "469006" }, { "海南省", "文昌", "469005" },
	    { "海南省", "五指山", "469001" }, { "海南省", "儋州", "469003" } };

    // 吉林
    public static final String[][] AT_CITY_LIST16 = {
	    { "吉林省", "长春", "220100" }, { "吉林省", "吉林省", "220200" },
	    { "吉林省", "延边朝鲜族自治州", "222400" }, { "吉林省", "白城", "220800" },
	    { "吉林省", "白山", "220600" }, { "吉林省", "辽源", "220400" },
	    { "吉林省", "四平", "220300" }, { "吉林省", "松原", "220700" },
	    { "吉林省", "通化", "220500" } };

    // 江苏
    public static final String[][] AT_CITY_LIST17 = {
	    { "江苏省", "南京", "320100" }, { "江苏省", "苏州", "320500" },
	    { "江苏省", "常州", "320400" }, { "江苏省", "连云港", "320700" },
	    { "江苏省", "泰州", "321200" }, { "江苏省", "无锡", "320200" },
	    { "江苏省", "徐州", "320300" }, { "江苏省", "扬州", "321000" },
	    { "江苏省", "镇江", "321100" }, { "江苏省", "淮安", "320800" },
	    { "江苏省", "南通", "320600" }, { "江苏省", "宿迁", "321300" },
	    { "江苏省", "盐城", "320900" } };

    // 江西
    public static final String[][] AT_CITY_LIST18 = {
	    { "江西省", "南昌", "360100" }, { "江西省", "赣州", "360700" },
	    { "江西省", "九江", "360400" }, { "江西省", "景德镇", "360200" },
	    { "江西省", "吉安", "360800" }, { "江西省", "萍乡", "360300" },
	    { "江西省", "上饶", "361100" }, { "江西省", "新余", "360500" },
	    { "江西省", "宜春", "360900" }, { "江西省", "鹰潭", "360600" },
	    { "江西省", "抚州", "361000" } };

    // 辽宁
    public static final String[][] AT_CITY_LIST19 = {
	    { "辽宁省", "沈阳", "210100" }, { "辽宁省", "大连", "210200" },
	    { "辽宁省", "鞍山", "210300" }, { "辽宁省", "丹东", "210600" },
	    { "辽宁省", "抚顺", "210400" }, { "辽宁省", "锦州", "210700" },
	    { "辽宁省", "营口", "210800" }, { "辽宁省", "本溪", "210500" },
	    { "辽宁省", "朝阳", "211300" }, { "辽宁省", "阜新", "210900" },
	    { "辽宁省", "葫芦岛", "211400" }, { "辽宁省", "辽阳", "211000" },
	    { "辽宁省", "盘锦", "211100" }, { "辽宁省", "铁岭", "211200" } };

    // 内蒙古
    public static final String[][] AT_CITY_LIST20 = {
	    { "内蒙古自治区", "呼和浩特", "150100" }, { "内蒙古自治区", "包头", "150200" },
	    { "内蒙古自治区", "赤峰", "150400" }, { "内蒙古自治区", "鄂尔多斯", "150600" },
	    { "内蒙古自治区", "乌兰察布", "150900" }, { "内蒙古自治区", "乌海", "150300" },
	    { "内蒙古自治区", "兴安盟", "152200" }, { "内蒙古自治区", "呼伦贝尔", "150700" },
	    { "内蒙古自治区", "通辽", "150500" }, { "内蒙古自治区", "阿拉善盟", "152900" },
	    { "内蒙古自治区", "巴彦淖尔", "150800" }, { "内蒙古自治区", "锡林郭勒", "152500" } };

    // 宁夏
    public static final String[][] AT_CITY_LIST21 = {
	    { "宁夏回族自治区", "银川", "640100" }, { "宁夏回族自治区", "石嘴山", "640200" },
	    { "宁夏回族自治区", "固原", "640400" }, { "宁夏回族自治区", "吴忠", "640300" },
	    { "宁夏回族自治区", "中卫", "640500" } };

    // 青海
    public static final String[][] AT_CITY_LIST22 = {
	    { "青海省", "西宁", "630100" }, { "青海省", "黄南藏族自治州", "632300" },
	    { "青海省", "玉树藏族自治州", "632700" }, { "青海省", "果洛藏族自治州", "632600" },
	    { "青海省", "海东地区", "632100" }, { "青海省", "海西蒙古族藏族自治州", "632800" },
	    { "青海省", "海南藏族自治州", "632500" }, { "青海省", "海北藏族自治州", "632200" } };

    // 山西
    public static final String[][] AT_CITY_LIST23 = {
	    { "山西省", "太原", "140100" }, { "山西省", "长治", "140400" },
	    { "山西省", "大同", "140200" }, { "山西省", "晋城", "140500" },
	    { "山西省", "晋中", "140700" }, { "山西省", "临汾", "141000" },
	    { "山西省", "吕梁", "141100" }, { "山西省", "朔州", "140600" },
	    { "山西省", "忻州", "140900" }, { "山西省", "运城", "140800" },
	    { "山西省", "阳泉", "140300" } };

    // 山东
    public static final String[][] AT_CITY_LIST24 = {
	    { "山东省", "济南", "370100" }, { "山东省", "青岛", "370200" },
	    { "山东省", "威海", "371000" }, { "山东省", "烟台", "370600" },
	    { "山东省", "潍坊", "370700" }, { "山东省", "泰安", "370900" },

	    { "山东省", "滨州", "371600" }, { "山东省", "德州", "371400" },
	    { "山东省", "东营", "370500" }, { "山东省", "菏泽", "371700" },
	    { "山东省", "济宁", "370800" }, { "山东省", "聊城", "371500" },
	    { "山东省", "临沂", "371300" }, { "山东省", "莱芜", "371200" },
	    { "山东省", "日照", "371100" }, { "山东省", "淄博", "370300" },
	    { "山东省", "枣庄", "370400" } };

    // 陕西
    public static final String[][] AT_CITY_LIST25 = {
	    { "陕西省", "西安", "610100" }, { "陕西省", "安康", "610900" },
	    { "陕西省", "宝鸡", "610300" }, { "陕西省", "汉中", "610700" },
	    { "陕西省", "商洛", "611000" }, { "陕西省", "铜川", "610200" },
	    { "陕西省", "渭南", "610500" }, { "陕西省", "咸阳", "610400" },
	    { "陕西省", "延安", "610600" }, { "陕西省", "榆林", "610800" } };

    // 四川
    public static final String[][] AT_CITY_LIST26 = {
	    { "四川省", "成都", "510100" }, { "四川省", "绵阳", "510700" },
	    { "四川省", "资阳", "512000" }, { "四川省", "巴中", "511900" },
	    { "四川省", "德阳", "510600" }, { "四川省", "达州", "511700" },
	    { "四川省", "广安", "511600" }, { "四川省", "广元", "510800" },
	    { "四川省", "乐山", "511100" }, { "四川省", "泸州", "510500" },
	    { "四川省", "眉山", "511400" }, { "四川省", "内江", "511000" },
	    { "四川省", "南充", "511300" }, { "四川省", "攀枝花", "510400" },
	    { "四川省", "遂宁", "510900" }, { "四川省", "宜宾", "511500" },
	    { "四川省", "雅安", "511800" }, { "四川省", "自贡", "510300" },
	    { "四川省", "阿坝藏族羌族自治州", "513200" }, { "四川省", "甘孜藏族自治州", "513300" },
	    { "四川省", "凉山彝族自治州", "513400" } };

    // 新疆
    public static final String[][] AT_CITY_LIST27 = {
	    { "新疆维吾尔自治区", "乌鲁木齐", "650100" }, { "新疆维吾尔自治区", "石河子", "659001" },
	    { "新疆维吾尔自治区", "吐鲁番地区", "652100" },
	    { "新疆维吾尔自治区", "伊犁哈萨克自治州", "654000" },
	    { "新疆维吾尔自治区", "阿克苏地区", "652900" },
	    { "新疆维吾尔自治区", "阿勒泰地区", "654300" },
	    { "新疆维吾尔自治区", "巴音郭楞蒙古自治州", "652800" },
	    { "新疆维吾尔自治区", "博尔塔拉蒙古自治州", "652700" },
	    { "新疆维吾尔自治区", "昌吉回族自治州", "652300" },
	    { "新疆维吾尔自治区", "哈密地区", "652200" }, { "新疆维吾尔自治区", "和田地区", "653200" },
	    { "新疆维吾尔自治区", "喀什地区", "653100" }, { "新疆维吾尔自治区", "克拉玛依", "650200" },
	    { "新疆维吾尔自治区", "克孜勒苏柯尔克孜自治州", "653000" },
	    { "新疆维吾尔自治区", "塔城地区", "654200" } };

    // 西藏
    public static final String[][] AT_CITY_LIST28 = {
	    { "西藏自治区", "拉萨", "540100" }, { "西藏自治区", "日喀则地区", "542300" },
	    { "西藏自治区", "阿里地区", "542500" }, { "西藏自治区", "昌都地区", "542100" },
	    { "西藏自治区", "林芝地区", "542600" }, { "西藏自治区", "那曲地区", "542400" },
	    { "西藏自治区", "山南地区", "542200" } };

    // 云南
    public static final String[][] AT_CITY_LIST29 = {
	    { "云南省", "昆明", "530100" }, { "云南省", "玉溪", "530400" },
	    { "云南省", "楚雄彝族自治州", "532300" }, { "云南省", "大理白族自治州", "532900" },
	    { "云南省", "红河哈尼族彝族自治州", "532500" }, { "云南省", "曲靖", "530300" },
	    { "云南省", "西双版纳傣族自治州", "532800" }, { "云南省", "昭通", "530600" },
	    { "云南省", "保山", "530500" }, { "云南省", "德宏傣族景颇族自治州", "533100" },
	    { "云南省", "迪庆藏族自治州", "533400" }, { "云南省", "丽江", "530700" },
	    { "云南省", "临沧", "530900" }, { "云南省", "怒江傈僳族自治州", "533300" },
	    { "云南省", "普洱", "530800" }, { "云南省", "文山壮族苗族自治州", "532600" } };

    // 浙江
    public static final String[][] AT_CITY_LIST30 = {
	    { "浙江省", "杭州", "330100" }, { "浙江省", "宁波", "330200" },
	    { "浙江省", "嘉兴", "330400" }, { "浙江省", "绍兴", "330600" },
	    { "浙江省", "温州", "330300" }, { "浙江省", "舟山", "330900" },
	    { "浙江省", "湖州", "330500" }, { "浙江省", "金华", "330700" },
	    { "浙江省", "丽水", "331100" }, { "浙江省", "台州", "331000" },
	    { "浙江省", "衢州", "330800" } };

    // 香港
    public static final String[][] AT_CITY_LIST31 = {
	    { "香港特别行政区", "中西区", "810001" }, { "香港特别行政区", "湾仔区", "810002" },
	    { "香港特别行政区", "东区", "810003" }, { "香港特别行政区", "南区", "810004" },
	    { "香港特别行政区", "油尖旺区", "810005" }, { "香港特别行政区", "深水埗区", "810006" },
	    { "香港特别行政区", "九龙城区", "810007" }, { "香港特别行政区", "黄大仙区", "810008" },
	    { "香港特别行政区", "观塘区", "810009" }, { "香港特别行政区", "荃湾区", "810010" },
	    { "香港特别行政区", "屯门区", "810011" }, { "香港特别行政区", "元朗区", "810012" },
	    { "香港特别行政区", "北区", "810013" }, { "香港特别行政区", "大埔区", "810014" },
	    { "香港特别行政区", "西贡区", "810015" }, { "香港特别行政区", "沙田区", "810016" },
	    { "香港特别行政区", "葵青区", "810017" }, { "香港特别行政区", "离岛区", "810018" } };

    // 澳门
    public static final String[][] AT_CITY_LIST32 = {
	    { "澳门特别行政区", "花地玛堂区", "820001" }, { "澳门特别行政区", "花王堂区", "820002" },
	    { "澳门特别行政区", "望德堂区", "820003" }, { "澳门特别行政区", "大堂区", "820004" },
	    { "澳门特别行政区", "风顺堂区", "820005" }, { "澳门特别行政区", "嘉模堂区", "820006" },
	    { "澳门特别行政区", "路氹城", "820007" }, { "澳门特别行政区", "圣方济各堂区", "820008" } };

    // 台湾
    public static final String[][] AT_CITY_LIST33 = { { "台湾", "台湾省", "710000" } };
    
    public static final Object[] AT_AREA_CITY_LIST = { AT_CITY_LIST0,
	    AT_CITY_LIST1, AT_CITY_LIST2, AT_CITY_LIST3, AT_CITY_LIST4,
	    AT_CITY_LIST5, AT_CITY_LIST6, AT_CITY_LIST7, AT_CITY_LIST8,
	    AT_CITY_LIST9, AT_CITY_LIST10, AT_CITY_LIST11, AT_CITY_LIST12,
	    AT_CITY_LIST13, AT_CITY_LIST14, AT_CITY_LIST15, AT_CITY_LIST16,
	    AT_CITY_LIST17, AT_CITY_LIST18, AT_CITY_LIST19, AT_CITY_LIST20,
	    AT_CITY_LIST21, AT_CITY_LIST22, AT_CITY_LIST23, AT_CITY_LIST24,
	    AT_CITY_LIST25, AT_CITY_LIST26, AT_CITY_LIST27, AT_CITY_LIST28,
	    AT_CITY_LIST29, AT_CITY_LIST30, AT_CITY_LIST31, AT_CITY_LIST32,
	    AT_CITY_LIST33 };
    public static ArrayList<String> GetAllProvinceCode(){
    	ArrayList<String> collectionNameList = new ArrayList<String>();
    	
    	for (int i = 0; i < CityCode.AT_AREA_CITY_LIST.length; i++) {
			String[][] cityCodeList = (String[][]) CityCode.AT_AREA_CITY_LIST[i];
			int cityCode = Integer.parseInt(cityCodeList[0][2]);
			int provinceCode = cityCode / 10000 * 10000;
			collectionNameList.add(provinceCode+"");
		}
    	
    	return collectionNameList;
    }
    
    public static ArrayList<String> GetAllProvinceCodeAndName(){
    	ArrayList<String> collectionNameList = new ArrayList<String>();
    	
    	for (int i = 0; i < CityCode.AT_AREA_CITY_LIST.length; i++) {
			String[][] cityCodeList = (String[][]) CityCode.AT_AREA_CITY_LIST[i];
			int cityCode = Integer.parseInt(cityCodeList[0][2]);
			String name = cityCodeList[0][0];
			int provinceCode = cityCode / 10000 * 10000;
			collectionNameList.add(provinceCode+":" + name);
			System.out.println(provinceCode+":" + name);
		}
    	
    	return collectionNameList;
    }
    
    public static void main(String[] args) {
    	GetAllProvinceCodeAndName();
	}
}